Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франДатаСдачи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франСдан</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура пр_РасходыПриИзмененииПосле(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 	
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СчетЗатрат) И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ТекущиеДанные.СчетЗатрат = пр_ПереходНаУНФВызовСервера.СчетУчетаЗатратНоменклатуры(ТекущиеДанные.Номенклатура);	
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	// Добавление в табличную часть "Расходы" поля "СчетЗатрат"
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.Расходы);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.Расходы.СчетЗатрат");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Счет затрат");
	КонтекстПоля.Свойства.Вставить("Доступность", 	Истина);
	
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "РасходыСчетЗатрат");
	
	// Группа ПР
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, Элементы.ДополнительноЛеваяКолонка);
	КонтекстГруппы.Свойства.Вставить("Заголовок", "Простые решения");
	КонтекстГруппы.Свойства.Вставить("ОтображатьЗаголовок", Истина);
 	ГруппаРеквизитыПР = РедакторФорм.ДобавитьГруппуОбычную(КонтекстГруппы, "ГруппаПростыеРешения");
	
	// франДатаСдачи
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франДатаСдачи");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Дата сдачи");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франДатаСдачи");
	
	// франСдан
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франСдан");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Сдан");
	КонтекстПоля.Свойства.Вставить("Вид", 			ВидПоляФормы.ПолеФлажка);
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франСдан");
	
	// переход с УПП
	пр_РаботаСФормами.пр_ДобавитьФлажкиПринадлежностиУчетовНаФорму(ЭтаФорма, Элементы.ДополнительноЛеваяКолонка);
		
КонецПроцедуры

#КонецОбласти
